esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
/*
 * Copyright 2006-2007, Queensland University of Technology
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not 
 * use this file except in compliance with the License. You may obtain a copy of 
 * the License at 
 * 
 *   http://www.apache.org/licenses/LICENSE-2.0 
 * 
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT 
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the 
 * License for the specific language governing permissions and limitations under 
 * the License.
 * 
 * Author: Bradley Beddoes
 * Creation Date: 19/12/2006
 * 
 * Purpose: Concrete implementation of all marshalling operations supported by saml2lib-cpp
 */

#ifndef MARSHALLERIMPL_H_
#define MARSHALLERIMPL_H_

/* OpenSSL */
#include <openssl/bio.h>
#include <openssl/evp.h>
#include <openssl/pem.h>

/* STL */
#include <map>
#include <vector>
#include <string>

/* XML Security */
#include <xsec/dsig/DSIGSignature.hpp>
#include <xsec/enc/OpenSSL/OpenSSLCryptoKeyRSA.hpp>
#include <xsec/framework/XSECException.hpp>

/* Xerces */
#include <xercesc/dom/DOMDocument.hpp>
#include <xercesc/dom/DOMElement.hpp>
#include <xercesc/dom/DOMImplementation.hpp>
#include <xercesc/dom/DOMLSSerializer.hpp>
#include <xercesc/dom/DOMException.hpp>
#include <xercesc/framework/MemBufFormatTarget.hpp>
#include <xercesc/framework/MemBufInputSource.hpp>
#include <xercesc/sax/SAXException.hpp>
#include <xercesc/util/XMLException.hpp>

/* XSD */
#include <xsd/cxx/tree/elements.hxx>
#include <xsd/cxx/tree/exceptions.hxx>

/* Local Codebase */
#include "saml2/exceptions/InvalidParameterException.h"
#include "saml2/exceptions/MarshallerException.h"
#include "saml2/handlers/Marshaller.h"
#include "saml2/handlers/SAMLDocument.h"
#include "saml2/namespace/NamespacePrefixMapper.h"
#include "saml2/SAML2Defs.h"
#include "saml2/logging/api.h"

XERCES_CPP_NAMESPACE_USE

namespace saml2
{
    /*
     * Concrete implementation of marshalling operations supported by the library.
     */
    template <class T>
    class MarshallerImpl : public saml2::Marshaller < T >
    {
    public:
        MarshallerImpl(Logger* logger, const std::string& schemaDir, const std::vector<std::string>& schemaList, const std::string& rootElementName, const std::string& namespaceURI);
        MarshallerImpl(Logger* logger, const std::string& schemaDir, const std::vector<std::string>& schemaList, const std::string& rootElementName, const std::string& namespaceURI, const std::string& keyPairName, XSECCryptoKey* pk);
        ~MarshallerImpl();

        SAMLDocument  marshallSigned(T*  xmlObj, const std::vector<std::string>& idList) override;
        SAMLDocument  marshallUnSigned(T*  xmlObj, bool addNamespaces = true) override;
        SAMLDocument  marshallUnSignedElement(T*  xmlObj) override;
        SAMLDocument  generateOutput(DOMElement* elem) override;
        DOMElement* generateDOMElement(T* xmlObj) override;
        DOMDocument* generateDOMDocument(T* xmlObj, bool addNamespaces = true) override;
        void sign(DOMDocument* domDoc, const std::vector<std::string>& idList) override;
        DOMDocument* validate(DOMDocument* domDoc) override;

    private:

        void init();
        DOMImplementation* generateDOMImplementation();
        SAMLDocument generateOutput(DOMDocument* domDoc);

        LocalLogger mLocalLogger;

        std::string mSchemaDir;
        std::vector<std::string> mSchemaList;
        std::string mRootElementName;
        std::string mNamespaceURI;

        XMLCh* mDefaultURI;
        XMLCh* mRootElement;
        XMLCh* mXmlns;
        XMLCh* mImplFlags;
        XMLCh* mEncoding;
        XMLCh* mDsigURI;
        XMLCh* mDsigSigElem;
        XMLCh* mDsigNS;
        XMLCh* mDsigKeyPairName;
        XMLCh* mSamlSiblingInsertAfter;

        DOMImplementation* mDomImpl;
        XSECCryptoKey* mPK;

        NamespacePrefixMapper mNamespaceMapper;

        std::unique_ptr<SAML2ErrorHandler> mErrorHandler;
        std::unique_ptr<ResourceResolver> mResourceResolver;
    };

    /*
     * Constructor for marshaller instances that are not required to do any cryptography
     */
    template <class T>
    MarshallerImpl<T>::MarshallerImpl(Logger* logger, const std::string& schemaDir, const std::vector<std::string>& schemaList, const std::string& rootElementName, const std::string& namespaceURI) :
        mLocalLogger(logger, "MarshallerImpl"),
        mSchemaDir(schemaDir),
        mSchemaList(schemaList),
        mRootElementName(rootElementName),
        mNamespaceURI(namespaceURI),
        mPK(nullptr),
        mDsigKeyPairName(nullptr)
    {
        init();
    }

    /*
     * Constructor for marshaller instances that are required to do cryptography.
     *
     * Caller is responsible for memory management of all passed data.
     */
    template <class T>
    MarshallerImpl<T>::MarshallerImpl(Logger* logger, const std::string& schemaDir, const std::vector<std::string>& schemaList, const std::string& rootElementName, const std::string& namespaceURI, const std::string& keyPairName, XSECCryptoKey* pk) :
        mLocalLogger(logger, "MarshallerImpl"),
        mSchemaDir(schemaDir),
        mSchemaList(schemaList),
        mRootElementName(rootElementName),
        mNamespaceURI(namespaceURI)
    {
        if (pk == nullptr)
            SAML2LIB_INVPARAM_EX("Supplied private key was NULL");

        mPK = pk;

        init();
        mDsigKeyPairName = XMLString::transcode(keyPairName.c_str());
    }

    /*
     * Destructor, frees all memory and terminates usage of Xerces and XSEC
     */
    template <class T>
    MarshallerImpl<T>::~MarshallerImpl()
    {
        XMLString::release(&mDefaultURI);
        XMLString::release(&mRootElement);
        XMLString::release(&mImplFlags);
        XMLString::release(&mXmlns);
        XMLString::release(&mEncoding);
        XMLString::release(&mDsigURI);
        XMLString::release(&mDsigSigElem);
        XMLString::release(&mDsigNS);
        XMLString::release(&mSamlSiblingInsertAfter);

        if (mDsigKeyPairName != NULL)
            XMLString::release(&mDsigKeyPairName);

        // According to the xml-security-c API docs, Terminate() can be called once for each time Initialize() was called.
        // This means that this won't affect other instances of Marshallers that we have.
        XSECPlatformUtils::Terminate();
        XMLPlatformUtils::Terminate();
    }

