esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
    /*
     * Initialization tasks common to both types of marshaller, initializes members,
     * Xerces and XSEC libraries
     */
    template <class T>
    void MarshallerImpl<T>::init()
    {
        XMLPlatformUtils::Initialize();
        XSECPlatformUtils::Initialise();

		mErrorHandler = std::make_unique<SAML2ErrorHandler>();
		mResourceResolver = std::make_unique<ResourceResolver>(mSchemaDir);

        if (mRootElementName.find(':') == std::string::npos)
        {
            const std::map<const char*, const char*>& namespaces = mNamespaceMapper.getNamespacesRef();
			for (const auto& namespaceIterator: namespaces)
            {
                if (mNamespaceURI == namespaceIterator.second)
                {
                    // Strip the leading 'xmlns:' that the namespace mapper uses
                    std::string namespaceAttribute = namespaceIterator.first;
                    std::size_t index = namespaceAttribute.find(':');
                    std::string qualName = namespaceAttribute;
                    if (index != std::string::npos)
                    {
                        qualName = namespaceAttribute.substr(index + 1);
                    }

                    this->mRootElementName = qualName + ":" + mRootElementName;
                }
            }

            // If we fall off the end of the loop without updating it, it will just stay as it was given.
        }

        this->mDefaultURI = XMLString::transcode(this->mNamespaceURI.c_str());
        this->mRootElement = XMLString::transcode(this->mRootElementName.c_str());
        this->mImplFlags = XMLString::transcode(IMPL_FLAGS);
        this->mXmlns = XMLString::transcode(XMLNS);
        this->mEncoding = XMLString::transcode(ENCODING);
        this->mDsigURI = XMLString::transcode(DSIG_URI);
        this->mDsigSigElem = XMLString::transcode(DSIG_SIG_ELEM);
        this->mDsigNS = XMLString::transcode(DSIG_NS);
        this->mSamlSiblingInsertAfter = XMLString::transcode(SAML_SIBLING_INSERT_AFTER);

        this->mDomImpl = DOMImplementationRegistry::getDOMImplementation(this->mImplFlags);
    }

    /*
     * Marshalls and performs cryptography on the presented object to a DOMDocument
     *
     * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
     * @param idList a list of ID's in the document to be signed. Id's should present in outter most to inner most order,
     * ie: Root element Id would be presented first with subsequent Id's to be signed in the document coming later,
     * all Id's in each "branch" of the document must be presented before moving to the next branch
     *
     * @exception MarshallerException, wrapped exception detailing error state
     * @exception InvalidParameterException, when invalid data is fed to the library
     */
    template <class T>
    SAMLDocument MarshallerImpl<T>::marshallSigned(T* xmlObj, const std::vector<std::string>& idList)
    {
        DOMDocument* domDoc = NULL;
        SAMLDocument samlDocument;

        if (xmlObj == NULL)
            SAML2LIB_INVPARAM_EX("Supplied xml object was NULL");

        if (this->mDsigKeyPairName == NULL)
            SAML2LIB_MAR_EX("Incorrect constructor called for signing document, re-initialise marshaller correctly");

        try
        {
            domDoc = this->generateDOMDocument(xmlObj);
            domDoc = validate(domDoc);

            sign(domDoc, idList);
            samlDocument = this->generateOutput(domDoc);
            domDoc->release();
            domDoc = NULL;
        }
        catch (xsd::cxx::tree::exception< wchar_t >  &exc)
        {
            mLocalLogger.warn() << "XSD tree exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("XSD exception while marshalling signed document", exc.what());
        }
        catch (std::bad_alloc &exc)
        {
            SAML2LIB_MAR_EX_CAUSE("Bad memory alloc while marshalling signed document", exc.what());
        }
        catch (SAXException &exc)
        {
            mLocalLogger.warn() << "SAX exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("SAXException while marshalling signed document", exc.getMessage());
        }
        catch (DOMException &exc)
        {
            mLocalLogger.warn() << "DOM exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("DOMException while marshalling signed document", exc.getMessage());
        }
        catch (XMLException &exc)
        {
            mLocalLogger.warn() << "XML exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("XMLException while marshalling signed document", exc.getMessage());
        }
        catch (std::exception &exc)
        {
            mLocalLogger.warn() << "Exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("Exception while marshalling signed document", exc.what());
        }
        catch (...)
        {
            SAML2LIB_MAR_EX("Generic exception while marshalling signed document");
        }

        return samlDocument;
    }

    /*
     * Marshalls the presented object to a DOMDocument
     *
     * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
     *
     * @exception MarshallerException, wrapped exception detailing error state
     * @exception InvalidParameterException, when invalid data is fed to the library
     */
    template <class T>
    SAMLDocument MarshallerImpl<T>::marshallUnSigned(T* xmlObj, bool addNamespaces)
    {
        DOMDocument* domDoc;
        SAMLDocument samlDocument;

        if (xmlObj == NULL)
            SAML2LIB_INVPARAM_EX("Supplied xml object was NULL");

        try
        {
            domDoc = this->generateDOMDocument(xmlObj, addNamespaces);
            samlDocument = this->generateOutput(domDoc);
            domDoc->release();
            domDoc = NULL;
        }
        catch (xsd::cxx::tree::exception< wchar_t >  &exc)
        {
            mLocalLogger.warn() << "XSD tree exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("XSD exception while marshalling unsigned document", exc.what());
        }
        catch (std::bad_alloc &exc)
        {
            SAML2LIB_MAR_EX_CAUSE("Bad memory alloc while marshalling unsigned document", exc.what());
        }
        catch (SAXException &exc)
        {
            mLocalLogger.warn() << "SAX exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("SAXException while marshalling unsigned document", exc.getMessage());
        }
        catch (DOMException &exc)
        {
            mLocalLogger.warn() << "DOM exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("DOMException while marshalling unsigned document", exc.getMessage());
        }
        catch (XMLException &exc)
        {
            mLocalLogger.warn() << "XML exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("XMLException while marshalling unsigned document", exc.getMessage());
        }
        catch (std::exception &exc)
        {
            mLocalLogger.warn() << "Exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("Exception while marshalling unsigned document", exc.what());
        }
        catch (...)
        {
            SAML2LIB_MAR_EX("Generic exception while marshalling unsigned document");
        }

        return samlDocument;
    }

