esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
    /*
     * Marshalls the presented object to a DOMElement
     *
     * @param xmlObj input object of generic type which the marshaller is acting for (XSD generated)
     *
     * @exception MarshallerException, wrapped exception detailing error state
     * @exception InvalidParameterException, when invalid data is fed to the library
     */
    template <class T>
    SAMLDocument MarshallerImpl<T>::marshallUnSignedElement(T*  xmlObj)
    {
        DOMElement* elem;
        SAMLDocument samlDocument;

        if (xmlObj == NULL)
            SAML2LIB_INVPARAM_EX("Supplied xml element was NULL");

        try
        {
            elem = generateDOMElement(xmlObj);
            samlDocument = this->generateOutput(elem);
        }
        catch (xsd::cxx::tree::exception< wchar_t >  &exc)
        {
            mLocalLogger.warn() << "XSD tree exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("XSD exception while marshalling unsigned element", exc.what());
        }
        catch (std::bad_alloc &exc)
        {
            SAML2LIB_MAR_EX_CAUSE("Bad memory alloc while marshalling unsigned element", exc.what());
        }
        catch (SAXException &exc)
        {
            mLocalLogger.warn() << "SAX exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("SAXException while marshalling unsigned element", exc.getMessage());
        }
        catch (DOMException &exc)
        {
            mLocalLogger.warn() << "DOM exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("DOMException while marshalling unsigned element", exc.getMessage());
        }
        catch (XMLException &exc)
        {
            mLocalLogger.warn() << "XML exception: " << exc.getMessage();
            SAML2LIB_MAR_EX_CAUSE("XMLException while marshalling unsigned element", exc.getMessage());
        }
        catch (std::exception &exc)
        {
            mLocalLogger.warn() << "Exception: " << exc.what();
            SAML2LIB_MAR_EX_CAUSE("Exception while marshalling unsigned element", exc.what());
        }
        catch (...)
        {
            SAML2LIB_MAR_EX("Generic exception while marshalling unsigned element");
        }

        return samlDocument;
    }

    /*
     * Translates generated DOMDocument into a series of bytes to return to caller
     */
    template <class T>
    SAMLDocument MarshallerImpl<T>::generateOutput(DOMDocument* domDoc)
    {
        DOMLSSerializer* writer = NULL;
        DOMLSOutput* theOutputDesc = NULL;
        MemBufFormatTarget *formatTarget = NULL;

        try
        {
            writer = mDomImpl->createLSSerializer();
            theOutputDesc = ((DOMImplementationLS*)mDomImpl)->createLSOutput();
            formatTarget = new MemBufFormatTarget();

            // Ensure we generate BOM
            writer->getDomConfig()->setParameter(XMLUni::fgDOMWRTBOM, true);
            writer->getDomConfig()->setParameter(XMLUni::fgDOMXMLDeclaration, false);
            theOutputDesc->setEncoding(mEncoding);
            theOutputDesc->setByteStream(formatTarget);

            writer->write(dynamic_cast<DOMNode*>(domDoc), theOutputDesc);

            XMLSize_t length = formatTarget->getLen();
            SAMLByte *document = new SAMLByte[length];
            std::memcpy(document, formatTarget->getRawBuffer(), length);

            delete formatTarget;
            formatTarget = NULL;

            writer->release();
            writer = NULL;

            return SAMLDocument(document, length);
        }
        catch (...)
        {
            mLocalLogger.warn() << "Exception occurred while generating output.";
            if (formatTarget != NULL)
            {
                delete formatTarget;
                formatTarget = NULL;
            }

            if (writer != NULL)
            {
                writer->release();
                writer = NULL;
            }

            throw;
        }
    }

    /*
     * Translates generated DOMElement into a series of bytes to return to caller
     */
    template <class T>
    SAMLDocument MarshallerImpl<T>::generateOutput(DOMElement* elem)
    {
        DOMLSSerializer* writer = NULL;
        DOMLSOutput* theOutputDesc = NULL;
        MemBufFormatTarget *formatTarget = NULL;

        try
        {
            writer = mDomImpl->createLSSerializer();
            theOutputDesc = ((DOMImplementationLS*)mDomImpl)->createLSOutput();
            formatTarget = new MemBufFormatTarget();

            // Ensure we generate BOM            
            writer->getDomConfig()->setParameter(XMLUni::fgDOMWRTBOM, true);
            writer->getDomConfig()->setParameter(XMLUni::fgDOMXMLDeclaration, false);
            theOutputDesc->setEncoding(mEncoding);
            theOutputDesc->setByteStream(formatTarget);

            writer->write(dynamic_cast<DOMNode*>(elem), theOutputDesc);

            XMLSize_t length = formatTarget->getLen();
            SAMLByte *document = new SAMLByte[length];
            std::memcpy(document, formatTarget->getRawBuffer(), length);

            delete formatTarget;
            formatTarget = NULL;

            writer->release();
            writer = NULL;

            return SAMLDocument(document, length);
        }
        catch (...)
        {
            mLocalLogger.warn() << "Exception occurred while generating output.";
            if (formatTarget != NULL)
            {
                delete formatTarget;
                formatTarget = NULL;
            }

            if (writer != NULL)
            {
                writer->release();
                writer = NULL;
            }

            throw;
        }
    }

    /*
     * Retrieves DOMImplmentation from Xerces registry
     */
    template <class T>
    DOMImplementation* MarshallerImpl<T>::generateDOMImplementation()
    {
        DOMImplementation* domImpl;
        domImpl = DOMImplementationRegistry::getDOMImplementation(this->mImplFlags);
        return domImpl;
    }

    /*
     * Utilising XSD generated code translates the supplied object into
     * Xerces DOMDocument format for further processing
     */
    template <class T>
    DOMDocument* MarshallerImpl<T>::generateDOMDocument(T* xmlObj, bool addNamespaces)
    {
        DOMDocument* domDoc = NULL;
        DOMElement* rootElem = NULL;

        XMLCh* uriVal = NULL;
        XMLCh* qualName = NULL;

        try
        {
            domDoc = this->mDomImpl->createDocument(mDefaultURI, mRootElement, 0);
            domDoc->setXmlStandalone(true); //TODO: confirm this is accurate
            rootElem = domDoc->getDocumentElement();

