esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
            if (addNamespaces)
            {
                const std::map<const char*, const char*>& namespaces = mNamespaceMapper.getNamespacesRef();
				for (const auto& i: namespaces)
                {
                    qualName = XMLString::transcode(i.first);
                    uriVal = XMLString::transcode(i.second);
                    rootElem->setAttributeNS(this->mXmlns, qualName, uriVal);

                    XMLString::release(&qualName);
                    XMLString::release(&uriVal);
                    uriVal = NULL;
                    qualName = NULL;
                }
            }
            else
            {
                // Find the single namespace we need and add it.
                const std::map<const char*, const char*>& namespaces = mNamespaceMapper.getNamespacesRef();
				for (const auto& i: namespaces)
                {
                    if (mNamespaceURI == i.second)
                    {
                        qualName = XMLString::transcode(i.first);
                        uriVal = XMLString::transcode(i.second);
                        rootElem->setAttributeNS(this->mXmlns, qualName, uriVal);

                        XMLString::release(&qualName);
                        XMLString::release(&uriVal);
                        uriVal = NULL;
                        qualName = NULL;

                        break;
                    }
                }
            }

            /* Populate the root node of the generated DOMDocument with data from the supplied
             * object generated by XSD schema translator
             */
            *rootElem << *xmlObj;
        }
        catch (...)
        {
            mLocalLogger.warn() << "Exception occurred while generating DOMDocument object.";
            if (uriVal != NULL)
            {
                XMLString::release(&uriVal);
                uriVal = NULL;
            }

            if (qualName != NULL)
            {
                XMLString::release(&qualName);
                qualName = NULL;
            }

            throw;
        }

        return domDoc;
    }

    /*
     * Utilising XSD generated code translates the supplied object into
     * Xerces DOMElement format for further processing
     */
    template <class T>
    DOMElement* MarshallerImpl<T>::generateDOMElement(T* xmlObj)
    {
        DOMDocument* domDoc = NULL;
        DOMElement* rootElem = NULL;

        XMLCh* uriVal = NULL;
        XMLCh* qualName = NULL;

        try
        {
            domDoc = this->mDomImpl->createDocument(mDefaultURI, mRootElement, 0);
            domDoc->setXmlStandalone(true); //TODO: confirm this is accurate
            rootElem = domDoc->getDocumentElement();

            const std::map<const char*, const char*>& namespaces = mNamespaceMapper.getNamespacesRef();
			for (const auto& i: namespaces)
            {
                qualName = XMLString::transcode(i.first);
                uriVal = XMLString::transcode(i.second);
                rootElem->setAttributeNS(this->mXmlns, qualName, uriVal);

                XMLString::release(&qualName);
                XMLString::release(&uriVal);
                uriVal = NULL;
                qualName = NULL;
            }

            /* Populate the root node of the generated DOMDocument with data from the supplied
             * object generated by XSD schema translator
             */
            *rootElem << *xmlObj;
        }
        catch (...)
        {
            mLocalLogger.warn() << "Exception occurred while generating DOMElement";
            if (uriVal != NULL)
            {
                XMLString::release(&uriVal);
                uriVal = NULL;
            }

            if (qualName != NULL)
            {
                XMLString::release(&qualName);
                qualName = NULL;
            }

            throw;
        }

        return rootElem;
    }

    /*
     * Utilises Xerces DOM level 3 DOMBuilder object to parse and validate the supplied DOMDocument
     * instance, returns instance of DOMDocument generated by parsing
     */
    template <class T>
    DOMDocument* MarshallerImpl<T>::validate(DOMDocument* domDoc)
    {
        DOMLSParser* parser = nullptr;
        DOMLSSerializer* writer = NULL;
        DOMLSOutput* theOutputDesc = NULL;
        MemBufInputSource* inputSource = NULL;
        MemBufFormatTarget *formatTarget = NULL;
        XMLCh* schema = NULL;

        try
        {
            /* Xerces parser requires input in the form of a mem buffer and can't at this time
             * take a straight DOMDocument, use the DOMWriter below to set up the environment for validating
             * our outgoing XML representation
             */
            writer = ((DOMImplementationLS*)mDomImpl)->createLSSerializer();
            theOutputDesc = ((DOMImplementationLS*)mDomImpl)->createLSOutput();
            formatTarget = new MemBufFormatTarget();

            // Setup all the required parser variables, NB dont trust 'defaults'
            writer->getDomConfig()->setParameter(XMLUni::fgDOMWRTBOM, true);
            writer->getDomConfig()->setParameter(XMLUni::fgDOMXMLDeclaration, false);
            // This is particuarly important so that signatures are not corrupted
            writer->getDomConfig()->setParameter(XMLUni::fgDOMWRTDiscardDefaultContent, false);

            theOutputDesc->setEncoding(mEncoding);
            theOutputDesc->setByteStream(formatTarget);

            writer->write(dynamic_cast<DOMNode*>(domDoc), theOutputDesc);
            writer->release();
            writer = NULL;

            domDoc->release();
            domDoc = NULL;

            parser = ((DOMImplementationLS*)mDomImpl)->createLSParser(DOMImplementationLS::MODE_SYNCHRONOUS, 0);
            parser->getDomConfig()->setParameter(XMLUni::fgXercesSchema, true);
            parser->getDomConfig()->setParameter(XMLUni::fgDOMValidate, true);
            parser->getDomConfig()->setParameter(XMLUni::fgDOMNamespaces, true);
            parser->getDomConfig()->setParameter(XMLUni::fgDOMElementContentWhitespace, false);
            parser->getDomConfig()->setParameter(XMLUni::fgXercesUseCachedGrammarInParse, true);
            parser->getDomConfig()->setParameter(XMLUni::fgXercesUserAdoptsDOMDocument, true);
            // This is particuarly important so that signatures are not corrupted
            parser->getDomConfig()->setParameter(XMLUni::fgDOMDatatypeNormalization, false);
            parser->getDomConfig()->setParameter(XMLUni::fgXercesEntityResolver, mResourceResolver.get());
            parser->getDomConfig()->setParameter(XMLUni::fgDOMErrorHandler, mErrorHandler.get());

			for (const auto& i : mSchemaList)
            {
                schema = XMLString::transcode(i.c_str());
                parser->loadGrammar(schema, Grammar::SchemaGrammarType, true);
                XMLString::release(&schema);
            }

            inputSource = new MemBufInputSource(formatTarget->getRawBuffer(), formatTarget->getLen(), MARSHALLER_ID);
            Wrapper4InputSource wrapedSource(inputSource);
            domDoc = parser->parse(&wrapedSource);
            parser->release();
            parser = NULL;

            delete formatTarget;
        }
        catch (...)
        {
            mLocalLogger.warn() << "Exception occurred while validating DOMDocument";
            /* Clean up any memory allocated and throw back up stack */
            if (schema != NULL)
            {
                XMLString::release(&schema);
                schema = NULL;
            }

            if (writer != NULL)
            {
                writer->release();
                writer = NULL;
            }

