esoeproject/esoeproject/saml2cpp/include/saml2/handlers/impl/MarshallerImpl.h
            if (domDoc != NULL)
            {
                domDoc->release();
                domDoc = NULL;
            }

            //if (wrapedSource != NULL)
            //{
            //    wrapedSource->release();
            //    wrapedSource = NULL;
            //}

            if (parser != NULL)
            {
                parser->release();
                parser = NULL;
            }

            throw;
        }

        return domDoc;
    }

    /*
     * Performs all cryptography operations associated with signing the supplied domDocument,
     * utilises the apache XML Security C library
     */
    template <class T>
    void MarshallerImpl<T>::sign(DOMDocument* domDoc, const std::vector<std::string>& idList)
    {
        XSECProvider prov;
        DSIGSignature* sig = NULL;
        DOMElement* sigNode = NULL;
        DOMElement* elem = NULL;;
        DSIGReference* ref = NULL;

        XMLCh* id = NULL;
        XMLCh* refURL = NULL;
        std::string currentId;

        try
        {
            for (std::vector<std::string>::const_reverse_iterator i = idList.rbegin(); i < idList.rend(); i++)
            {
                /* Create Id and reference URL data types to xmldisg spec */
                currentId = *i;

                id = XMLString::transcode(currentId.c_str());
                currentId.insert(0, DSIG_ID_LEAD_CH);
                refURL = XMLString::transcode(currentId.c_str());

                /* Get the parent element for which we wish to create a signature by Id, create a new signature element
                 * assign the Marshaller private key for signing purposes, create all references and sign the actual document.
                 * This process is repeated for each Id the caller wishes to sign in the reverse order to which Id's are presented,
                 * to ensure that outer signature blocks are calculated with inner signature blocks as part of the byte stream.
                 */
                elem = domDoc->getElementById(id);

                if (elem == NULL)
                    SAML2LIB_MAR_EX("Provided Id was not able to be located in document as a reference to a suitable parent element");

                sig = prov.newSignature();
                sig->setDSIGNSPrefix(this->mDsigNS);
                sig->setECNSPrefix(NULL);
                sig->setXPFNSPrefix(NULL);
                sig->setPrettyPrint(false);

                sigNode = sig->createBlankSignature(domDoc, CANON_C14NE_NOC, SIGNATURE_RSA, HASH_SHA1);
                /* Keydata is cloned and owned by crypto library here which it will clean up */
                // TODO Probably leaking memory here - I think you need to delete the cloned key -SM
                sig->setSigningKey(this->mPK->clone());
                sig->appendKeyName(this->mDsigKeyPairName, false);

                ref = sig->createReference(refURL, HASH_SHA1);
                ref->appendEnvelopedSignatureTransform();
                ref->appendCanonicalizationTransform(CANON_C14NE_NOC);

                if (elem->hasChildNodes())
                {
                    /* This needs to be investigated further when time permits to find a better way to position
                     * the generated Signature element to ensure a valid document, at the moment with SAML 2.0 schema
                     * we know the Signature block is either the first child of the parent node or the second child of the parent node
                     * if an optional Issuer element is present, at any rate its not 100% clean and should be fixed up
                     */
                    if (XMLString::equals(elem->getFirstChild()->getNodeName(), mSamlSiblingInsertAfter))
                        if (elem->getFirstChild()->getNextSibling() == NULL)
                            elem->appendChild(sigNode);
                        else
                            elem->insertBefore(sigNode, elem->getFirstChild()->getNextSibling());
                    else
                        elem->insertBefore(sigNode, elem->getFirstChild());
                }
                else
                {
                    elem->appendChild(sigNode);
                }

                sig->sign();
                prov.releaseSignature(sig);
                sig = NULL;

                XMLString::release(&id);
                id = NULL;
                XMLString::release(&refURL);
                refURL = NULL;
            }
        }
        catch (XSECCryptoException &exc)
        {
            mLocalLogger.warn() << "Exception with XSEC Crypto: " << exc.getMsg();
            if (domDoc != NULL)
            {
                domDoc->release();
                domDoc = NULL;
            }

            if (sig != NULL)
            {
                prov.releaseSignature(sig);
                sig = NULL;
            }

            if (id != NULL)
            {
                XMLString::release(&id);
                id = NULL;
            }

            if (refURL != NULL)
            {
                XMLString::release(&refURL);
                refURL = NULL;
            }

            SAML2LIB_MAR_EX_CAUSE("An exception occurred during an encryption operation", exc.getMsg());
        }
        catch (XSECException &exc)
        {
            mLocalLogger.warn() << "XSEC library threw an exception: " << exc.getMsg();
            if (domDoc != NULL)
            {
                domDoc->release();
                domDoc = NULL;
            }

            if (sig != NULL)
            {
                prov.releaseSignature(sig);
                sig = NULL;
            }

            if (id != NULL)
            {
                XMLString::release(&id);
                id = NULL;
            }

            if (refURL != NULL)
            {
                XMLString::release(&refURL);
                refURL = NULL;
            }

            SAML2LIB_MAR_EX_CAUSE("An exception occurred during a security operation", exc.getMsg());
        }
        catch (...)
        {
            mLocalLogger.warn() << "Generic exception while signing document.";
            if (domDoc != NULL)
            {
                domDoc->release();
                domDoc = NULL;
            }

            if (sig != NULL)
            {
                prov.releaseSignature(sig);
                sig = NULL;
            }

            if (id != NULL)
            {
                XMLString::release(&id);
                id = NULL;
            }

            if (refURL != NULL)
            {
                XMLString::release(&refURL);
                refURL = NULL;
            }

            throw;
        }
    }
}

#endif /*MARSHALLERIMPL_H_*/
